# import libraries

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.impute import KNNImputer,SimpleImputer
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score

C:\Users\hpcod\AppData\Roaming\Python\Python311\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

# import dataset

In [4]:
df =pd.read_csv('train.csv')[['Age','Pclass','Fare','Survived']]

In [5]:
df.sample(10)

      Age  Pclass      Fare  Survived
408  21.0       3    7.7750         0
172   1.0       3   11.1333         1
87    NaN       3    8.0500         0
690  31.0       1   57.0000         1
604  35.0       1   26.5500         1
312  26.0       2   26.0000         0
882  22.0       3   10.5167         0
390  36.0       1  120.0000         1
203  45.5       3    7.2250         0
132  47.0       3   14.5000         0

# Check Missing Value

In [6]:
df.isnull().mean()*100

Age         19.86532
Pclass       0.00000
Fare         0.00000
Survived     0.00000
dtype: float64

# Define X & y

In [8]:
X = df.drop(columns=['Survived'])
y = df['Survived']

# Train Test Split

In [9]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=2)

In [10]:
X_train

      Age  Pclass      Fare
30   40.0       1   27.7208
10    4.0       3   16.7000
873  47.0       3    9.0000
182   9.0       3   31.3875
876  20.0       3    9.8458
..    ...     ...       ...
534  30.0       3    8.6625
584   NaN       3    8.7125
493  71.0       1   49.5042
527   NaN       1  221.7792
168   NaN       1   25.9250

[712 rows x 3 columns]

In [11]:
X_test

      Age  Pclass     Fare
707  42.0       1  26.2875
37   21.0       3   8.0500
615  24.0       2  65.0000
169  28.0       3  56.4958
68   17.0       3   7.9250
..    ...     ...      ...
89   24.0       3   8.0500
80   22.0       3   9.0000
846   NaN       3  69.5500
870  26.0       3   7.8958
251  29.0       3  10.4625

[179 rows x 3 columns]

In [12]:
y_test

707    1
37     0
615    1
169    0
68     1
      ..
89     0
80     0
846    0
870    0
251    0
Name: Survived, Length: 179, dtype: int64

In [13]:
y_train

30     0
10     1
873    0
182    0
876    0
      ..
534    0
584    0
493    0
527    0
168    0
Name: Survived, Length: 712, dtype: int64

# Apply KNN imputer

In [22]:
knn = KNNImputer(n_neighbors=5,weights='distance')
X_train_trf = knn.fit_transform(X_train)
X_test_trf = knn.transform(X_test)

# Convert in Data Frame

In [23]:
pd.DataFrame(X_train_trf,columns=X_train.columns)

           Age  Pclass      Fare
0    40.000000     1.0   27.7208
1     4.000000     3.0   16.7000
2    47.000000     3.0    9.0000
3     9.000000     3.0   31.3875
4    20.000000     3.0    9.8458
..         ...     ...       ...
707  30.000000     3.0    8.6625
708  25.223022     3.0    8.7125
709  71.000000     1.0   49.5042
710  33.279590     1.0  221.7792
711  49.275927     1.0   25.9250

[712 rows x 3 columns]

# Apply Logistic Regression

In [24]:
lr = LogisticRegression()
lr.fit(X_train_trf,y_train)
y_pred = lr.predict(X_test_trf)
accuracy_score(y_test,y_pred)

0.7094972067039106